Repository: alvarobello33/WikiFilms
Catalog: nil.bagaria_alvaro.bello/nil.bagaria_alvaro.bello/*.lproj/Localizable.strings
Languages: es

source: Register
es: Registro

# login_message
source: Please, enter your account.
es: Por favor, inicie sesión.

source: Password
es: Contraseña

# register_message
source: Fill in the following fields to complete the registration process.
es: Rellena los siguientes campos para completar el proceso de registro.

source: Repeat email
es: Repetir correo electrónico

source: Username
es: Nombre de usuario

source: Repeat password
es: Repetir contraseña

source: Home
es: Inicio

source: Details
es: Detalles

source: Save
es: Guardar

source: WatchList
es: Mi Lista

# search_bar
source: Search...
es: Buscar...

source: Profile
es: Perfil

source: Change Email
es: Cambiar correo electrónico

source: New Email
es: Nuevo correo electrónico

source: Change Password
es: Cambiar contraseña

source: New Password
es: Nueva contraseña

source: Repeat New Password
es: Repetir nueva contraseña

source: Save Changes
es: Guardar cambios

# miss_info
source: Missing Information
es: Campos Vacíos

# miss_info_text
source: Please enter both email and password.
es: Por favor, introduce ambos campos: correo electrónico y contraseña.

source: Login Error
es: Error de Inicio de Sesión

# login_error_text
source: Invalid credentials or the user does not exist. Please, try again.
es: Usuario y/o contraseña incorrectos. Por favor, vuelve a intentarlo.

# auth_reason
source: Authenticate to access WikiFilms.
es: Autenticación para acceder a WikiFilms.

# auth_failed
source: Authentication failed
es: Autenticación Fallida

# auth_failed_reason
source: Biometric authentication was not successfull. Please log in using your credentials.
es: Autenticación Biométrica Fallida. Por favor, inicia sesión utilizando las credenciales.

source: Unvailable
es: No Disponible

# biometric_not_available
source: Biometric authentication is not available on this device.
es: Autenticación Biométrica no disponible en este dispositivo.

# accept_alert
source: Accept
es: Aceptar

source: Login required
es: Inicio de Sesión Necesario

# login_required_text
source: Please log in once before using biometric authentication.
es: Por favor, inicie sesión por lo menos una vez, antes de poder usar la autenticación biométrica.

# miss_info_fields
source: Please fill all the fields with the correct information.
es: Por favor, rellelna todos los campos.

# invalid_mail
source: Invalid Email
es: Correo Electrónico Incorrecto

# mail_must_contain
source: Email must contain '@' and '.' to be valid.
es: El correo electrónico debe contener '@' y '.' para ser válido.

# missmatch_mail
source: Missmatched Emails
es: Correo Electrónico Distinto.

# fields_not_match
source: Email fields do not match.
es: Los campos del correo electrónico no coinciden. Por favor, asegúrate de que sean iguales.

# invalid_psswd
source: Invalid password
es: Contraseña Incorrecta

# psswd_requirements
source: Password must be at least 6 characters long and include one uppercase letter, one lowercase letter and one number.
es: La contraseña debe tener, como mínimo: - 6 caracteres. - Una letra mayúscula. - Una letra minúscula. - Un número.

# missmatch_pswd
source: Missmatched Passwords
es: Contraseñas Distintas

# pswd_fields_not_match
source: Password fields do not match.
es: Los campos de las contraseñas no coinciden. Por favor, asegúrate de que sean iguales.

source: Register Error
es: Error de Registro

# register_error_firebase
source: There was an error creating the new user or the email used already exists. Please, try again.
es: Ha habido un error creando el nuevo usuario o el correo introducido ya existe. Por favor, vuelve a intentarlo.

# db_error
source: Database Error
es: Error Base de Datos

# db_error_text
source: Error saving data to Database. Please, try again later.
es: Error guardando los datos en la Base de Datos. Por favor, inténtalo de nuevo más tarde.

# success_alert
source: Success!
es: Completado!

# succes_login
source: User registered successfully. You can now log in.
es: Usuario registrado correctamente. Ahora puedes iniciar sesión.

source: Top Rated
es: Mejor Valorados

source: Popular
es: Populares

source: Top Rated Movies
es: Pel·lículas Mejor Valoradas

# delete_error
source: Error deleting movie from WatchList.
es: Error eliminando pel·lícula de MiLista.

# not_saved
source: Could not save movie.
es: No se ha podido guardar la pel·lícula.

source: Saved
es: Guardado

# added_watchlist
source: Movie added to WatchList.
es: Pel·lícula añadida a MiLista.

# profile_invalid_mail
source: Invalid email
es: Correo Electrónico Inválido

# profile_invalid_mail_text
source: Please enter a valid email address.
es: El correo electrónico debe contener '@' y '.' para ser válido.

# same_email
source: The new email is the same as the actual users email.
es: El nuevo correo electrónico coincide con el correo electrónico actual del usuario. Por favor, introduce un nuevo correo electrónico.

# profile_pswd_error
source: Password error
es: Error de contraseña

# profile_pswd_not_match
source: Passwords do not match.
es: Los campos de las contraseñas no coinciden.

# profie_pswd_error_changing
source: Error changing the password.
es: Error cambiando la contraseña.

# prof_success
source: Changes Saved!
es: ¡Completado!

# prof_updated
source: Profile updated successfully. You will be loged out automatically to apply the changes. Please, log in again.
es: Perfil actualizado correctamente. Se cerrará la sesión automáticamente para aplicar los cambios. Por favor, vuelve a iniciar sesión.

# logout_buton
source: Logout
es: Cerrar Sesión

source: Log Out Error
es: Error Cerrando Sesión

# logout_error_text
source: Unable to log out. Please try again.
es: No se ha podido cerrar sesión. Por favor, vuelve a intentarlo.

source: Session expired
es: Sesión caducada

# login_required_to_update
source: For security reasons, please log in again to apply this change.
es: Por seguridad, debes volver a iniciar sesión para aplicar este cambio.

# login_again
source: Please log in again to continue.
es: Vuelve a iniciar sesión para continuar.

source: Profile error
es: Error de perfil

# username_update_error
source: Username could not be updated.
es: No se ha podido actualizar el nombre de usuario.

# username_updated
source: Username updated successfully. Log in again to see the changes updated.
es: Nombre de usuario actualizado correctamente. Vuelve a iniciar sesión para reflejar el cambio.
